config/cf/ChartsOfCharacteristicTypes/ВидыХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВидыХарактеристик</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассWMI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоWMI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомерWMI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительWMI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелитьНаЧислоWMI</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассAIDA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоAIDA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомерAIDA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительAIDA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелитьНаЧислоAIDA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеБезРодительскойСекцииAIDA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриПоискеВключатьЗначениеПеременнойСекцииAIDA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенияAIDA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВАвтоНаименовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПредставлениеВАвтоНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВАвтоНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключенияWMI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

config/cf/ChartsOfCharacteristicTypes/ВидыХарактеристик/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Заполнить виды характеристик при первоначальном заполнении.
//
Процедура ЗаполнитьВидыХарактеристикПриПервоначальномЗаполнении() Экспорт
	
	ВХ = ПланыВидовХарактеристик.ВидыХарактеристик;
	ВН = Справочники.ВидыНоменклатуры;
	
	// WMI	
	СтрИсключенияПОAIDA = 
		"Обновление безопасности
		|Исправление для Windows
		|Update for Microsoft
		|Обновление для Windows
		|Java Auto Updater
		|Java(TM)
		|Microsoft .NET Framework
		|Microsoft.NET Framework
		|Microsoft Silverlight
		|MSXML
		|Audio Driver
		|Hotfix for Microsoft
		|Service Pack";
		
	СтрИсключенияПринтерыAIDA =
		"Fax
		|OneNote
		|PDF
		|Microsoft XPS Document Writer";
		
	СтрИсключенияСетевыеКартыAIDA =
		"Минипорт
		|Bluetooth
		|Miniport
		|VirtualBox
		|RAS Async Adapter
		|Microsoft Kernel Debug Network Adapter
		|Teredo Tunneling Pseudo-Interface
		|Адаптер";
	
	// Для групп
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ВидНоменклатуры");
	ТЗ.Колонки.Добавить("КлассWMI");
	ТЗ.Колонки.Добавить("СвойствоWMI");	
	ТЗ.Колонки.Добавить("СерийныйНомерWMI");
	ТЗ.Колонки.Добавить("ПроизводительWMI");	
	ТЗ.Колонки.Добавить("КлассAIDA");
	ТЗ.Колонки.Добавить("СвойствоAIDA");	
	ТЗ.Колонки.Добавить("СерийныйНомерAIDA");
	ТЗ.Колонки.Добавить("ПроизводительAIDA");
	ТЗ.Колонки.Добавить("ОпределениеБезРодительскойСекцииAIDA");	
	ТЗ.Колонки.Добавить("ПриПоискеВключатьЗначениеПеременнойСекцииAIDA");
	ТЗ.Колонки.Добавить("ИсключенияAIDA");
	ТЗ.Колонки.Добавить("ИсключенияWMI");
		
	ДобавитьВТЗГруппы(ТЗ, ВХ.ВидеоКарта, НСтр("ru = 'Видеокарта'"), ВН.Видеокарта, "Win32_VideoController", "Name", "PNPDeviceID", "AdapterCompatibility",    "Видео Windows","Свойства видеоадаптера|Описание устройства","","Производитель видеоадаптера|Фирма",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.ЖесткийДиск, НСтр("ru = 'Жесткий диск'"), ВН.ЖесткийДиск, "Win32_DiskDrive", "Model", "SerialNumber", "",    "ATA","Свойства устройства ATA|ID модели","Свойства устройства ATA|Серийный номер","Производитель ATA-устройства|Фирма",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.ЗвуковаяКарта, НСтр("ru = 'Звуковая карта'"), ВН.ЗвуковаяКарта, "Win32_SoundDevice", "Name", "DeviceID", "Manufacturer",    "","","","",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Клавиатура, НСтр("ru = 'Клавиатура'"), ВН.Клавиатура, "Win32_Keyboard", "Name", "DeviceID", "",    "Ввод","Свойства клавиатуры|Название клавиатуры","","",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.МатеринскаяПлата, "Материнская плата", ВН.МатеринскаяПлата, "Win32_BaseBoard", "Product", "", "Manufacturer",    "Системная плата","Свойства системной платы|Системная плата","Свойства системной платы|ID системной платы","Производитель системной платы|Фирма",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Память, НСтр("ru = 'Память'"), ВН.Память, "Win32_PhysicalMemory", "Name", "SerialNumber", "",    "SPD","Свойства модуля памяти|Имя модуля","","",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Привод, НСтр("ru = 'Привод'"), ВН.ОптическийПривод, "Win32_CDROMDrive", "Name", "SerialNumber", "",    "","","","",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Принтер, НСтр("ru = 'Принтер'"), ВН.Принтер, "Win32_Printer", "Name", "", "",    "Принтеры","Свойства принтера|Имя принтера","","Производитель принтера|Фирма",,,СтрИсключенияПринтерыAIDA,СтрИсключенияПринтерыAIDA);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Процессор, НСтр("ru = 'Процессор'"), ВН.Процессор, "Win32_Processor", "Name", "ProcessorId", "Manufacturer",    "ЦП","Свойства ЦП|Тип ЦП","","Производитель ЦП|Фирма",,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.СетеваяКарта, НСтр("ru = 'Сетевая карта'"), ВН.СетеваяКарта, "Win32_NetworkAdapter", "Name", "", "Manufacturer",    "Сеть PCI / PnP","Сеть PCI / PnP","","",,,СтрИсключенияСетевыеКартыAIDA,СтрИсключенияСетевыеКартыAIDA);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Монитор, НСтр("ru = 'Монитор'"), ВН.Монитор, "Win32_DesktopMonitor", "Name", "", "MonitorManufacturer","Монитор","Свойства монитора|Имя монитора","Свойства монитора|Серийный номер","Производитель монитора|Фирма",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Корпус, НСтр("ru = 'Корпус'"), ВН.Корпус, "Win32_SystemEnclosure", "Caption", "", "Manufacturer",    "","","","",,,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.Мышь, НСтр("ru = 'Мышь'"), ВН.Мышь, "", "", "", "",    "Ввод","Свойства мыши|Название мыши","","",,,,);
	
	ДобавитьВТЗГруппы(ТЗ, ВХ.ПрограммноеОбеспечение, НСтр("ru = 'Программное обеспечение'"), ВН.ПрограммноеОбеспечение, "", "", "", "",    "Установленные программы","Установленные программы","","",,Истина, СтрИсключенияПОAIDA, СтрИсключенияПОAIDA);	
	ДобавитьВТЗГруппы(ТЗ, ВХ.Лицензия, НСтр("ru = 'Лицензия'"), ВН.Лицензия, "", "", "", "",    "Лицензии","Лицензии","","",,Истина,,);
	ДобавитьВТЗГруппы(ТЗ, ВХ.ОперационнаяСистема, НСтр("ru = 'Операционная система'"), ВН.ПрограммноеОбеспечение, "Win32_OperatingSystem", "Caption", "SerialNumber", "Manufacturer",    "Суммарная информация","Компьютер|Операционная система","","",,,,);
	
	Для каждого Строки Из ТЗ Цикл
		Объект = Строки.Характеристика.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();		
	КонецЦикла;
	
	// Для элементов
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("Родитель");
	ТЗ.Колонки.Добавить("СвойствоWMI");
	ТЗ.Колонки.Добавить("ДелитьНаЧислоWMI");
	ТЗ.Колонки.Добавить("СвойствоAIDA");
	ТЗ.Колонки.Добавить("ДелитьНаЧислоAIDA");
	ТЗ.Колонки.Добавить("ОпределениеБезРодительскойСекцииAIDA");
	ТЗ.Колонки.Добавить("ПриПоискеВключатьЗначениеПеременнойСекцииAIDA");
	ТЗ.Колонки.Добавить("ИсключенияAIDA");
	ТЗ.Колонки.Добавить("ПредставлениеВАвтоНаименовании");
	ТЗ.Колонки.Добавить("ИспользоватьПредставлениеВАвтоНаименовании");
	ТЗ.Колонки.Добавить("ИспользоватьВАвтоНаименовании");
	ТЗ.Колонки.Добавить("ИсключенияWMI");
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.Видеопамять, НСтр("ru = 'Видеопамять'"), ВХ.ВидеоКарта, "AdapterRAM", 1073741824,   "Свойства видеоадаптера|Объем видеоОЗУ", ,,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.РежимыВидеоКарты, НСтр("ru = 'Режимы видеокарты'"), ВХ.ВидеоКарта, "VideoModeDescription",  , "", ,,,,,,,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ИнтерфейсВидеокарты, НСтр("ru = 'Интерфейс видеокарты'"), ВХ.ВидеоКарта, "",   , "Свойства видеоадаптера|Тип DAC", ,,,,Истина,"",Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.РазмерЖесткогоДиска, НСтр("ru = 'Размер жесткого диска'"), ВХ.ЖесткийДиск, "Size", 1073741824,   "Свойства устройства ATA|Неформатированная ёмкость", ,,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ИнтерфейсЖесткогоДиска, НСтр("ru = 'Интерфейс жесткого диска'"), ВХ.ЖесткийДиск, "InterfaceType",  , "Свойства устройства ATA|Тип устройства", ,,,,Истина,"",Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.РазмерПамяти, НСтр("ru = 'Размер памяти'"), ВХ.Память, "Capacity", 1073741824,   "Свойства модуля памяти|Размер модуля", ,,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.СкоростьПамяти, НСтр("ru = 'Скорость памяти'"), ВХ.Память, "Speed",  , "Свойства модуля памяти|Скорость памяти", ,,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ТипПамяти, НСтр("ru = 'Тип памяти'"), ВХ.Память, "",  , "Свойства модуля памяти|Тип памяти", ,,,,Истина,"",Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.АрхитектураОперационнойСистемы, НСтр("ru = 'Архитектура операционной системы'"), ВХ.ОперационнаяСистема, "OSArchitecture",   ,"", ,,,,,,,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.КоличествоЯдерПроцессора, НСтр("ru = 'Количество ядер процессора'"), ВХ.Процессор, "NumberOfCores",   ,"", , Истина,,,,,,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.СокетПроцессора, НСтр("ru = 'Сокет процессора'"), ВХ.Процессор, "SocketDesignation",   ,"Физическая информация о ЦП|Тип корпуса", , Истина,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ЧастотаПроцессора, НСтр("ru = 'Частота процессора'"), ВХ.Процессор, "",   ,"Свойства ЦП|Исходная частота", , Истина,,,Истина,"",Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.РазъемыОЗУМатеринскойПлаты, НСтр("ru = 'Разъемы ОЗУ'"), ВХ.МатеринскаяПлата, "",   ,"Физическая информация о системной плате|Разъёмы ОЗУ", , Ложь,,,Истина,"Слотов",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ФормФакторМатеринскойПлаты, НСтр("ru = 'Форм-фактор материнской платы'"), ВХ.МатеринскаяПлата, "",   ,"Физическая информация о системной плате|Форм-фактор", , Ложь,,,Истина,"",Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ЧипсетМатеринскойПлаты, НСтр("ru = 'Чипсет материнской платы'"), ВХ.МатеринскаяПлата, "",   ,"Физическая информация о системной плате|Чипсет системной платы", , Ложь,,,Истина,"",Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ВерсияПО, НСтр("ru = 'Версия ПО'"), ВХ.ПрограммноеОбеспечение, "",   ,"|Версия", , Истина, Истина,,Истина,"Версия", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.КлючПродукта, НСтр("ru = 'Ключ продукта'"), ВХ.Лицензия, "",   ,"Ключ продукта", , Истина, Истина,,Истина,"Ключ", Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.Мощность, НСтр("ru = 'Мощность'"), ВХ.БлокПитания, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.МощностьИБП, НСтр("ru = 'Мощность ИБП (Вт)'"), ВХ.ИБП, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ФорматКорпуса, НСтр("ru = 'Формат корпуса'"), ВХ.Корпус, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.МощностьБлокаПитанияКорпуса, НСтр("ru = 'Мощность блока питания корпуса'"), ВХ.Корпус, "",,,,,,,Истина,"", Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ВстроенныйМикрофон, НСтр("ru = 'Встроенный микрофон'"), ВХ.ВебКамера, "",,,,,,,Истина,"Микрофон", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.КреплениеВебКамеры, НСтр("ru = 'Крепление веб-камеры'"), ВХ.ВебКамера, "",,,,,,,Истина,"", Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.СоотношениеСторонМонитора, НСтр("ru = 'Соотношение сторон монитора'"), ВХ.Монитор, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ТипМонитора, НСтр("ru = 'Тип монитора'"), ВХ.Монитор, "",,,,,,,Истина,"", Истина,);
	
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ИнтерфейсНакопителяНоутбука, НСтр("ru = 'Интерфейс накопителя ноутбука'"), ВХ.Ноутбук, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ОбъемНакопителяНоутбука, НСтр("ru = 'Объем накопителя ноутбука'"), ВХ.Ноутбук, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ОСНоутбука, НСтр("ru = 'ОС ноутбука'"), ВХ.Ноутбук, "",,,,,,,Истина,"ОС", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ЭкранНоутбука, НСтр("ru = 'Экран ноутбука'"), ВХ.Ноутбук, "",,,,,,,Истина,"", Истина,);
	
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ИнтерфейсФлешНакопителя, НСтр("ru = 'Интерфейс флеш-накопителя'"), ВХ.ФлешНакопитель, "",,,,,,,Истина,"", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.ЦветФлешНакопителя, НСтр("ru = 'Цвет флеш-накопителя'"), ВХ.ФлешНакопитель, "",,,,,,,Истина,"Цвет", Истина,);
	ДобавитьВТЗЭлементы(ТЗ, ВХ.РазмерФлешНакопителя, НСтр("ru = 'Размер флеш накопителя'"), ВХ.ФлешНакопитель, "",,,,,,,Истина,"", Истина,);	
	
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Характеристика.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Записать();		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВТЗГруппы(ТЗ,
	Характеристика,
	Наименование,
	ВидНоменклатуры,
	КлассWMI,
	СвойствоWMI,	
	СерийныйНомерWMI,
	ПроизводительWMI,
	
	КлассAIDA,
	СвойствоAIDA,	
	СерийныйНомерAIDA,
	ПроизводительAIDA,
	ОпределениеБезРодительскойСекцииAIDA = Ложь,
	ПриПоискеВключатьЗначениеПеременнойСекцииAIDA = Ложь,
	ИсключенияAIDA = "",
	ИсключенияWMI = "")
	
	НоваяСтрока 					= ТЗ.Добавить();
	НоваяСтрока.Характеристика 		= Характеристика;
	НоваяСтрока.Наименование 		= Наименование;
	НоваяСтрока.КлассWMI 			= КлассWMI;
	НоваяСтрока.СвойствоWMI 		= СвойствоWMI;
	НоваяСтрока.ВидНоменклатуры 	= ВидНоменклатуры;
	НоваяСтрока.СерийныйНомерWMI 	= СерийныйНомерWMI;
	НоваяСтрока.ПроизводительWMI 	= ПроизводительWMI;
	НоваяСтрока.ИсключенияWMI		= ИсключенияWMI;
	
	НоваяСтрока.КлассAIDA 			= КлассAIDA;
	НоваяСтрока.СвойствоAIDA 		= СвойствоAIDA;
	НоваяСтрока.СерийныйНомерAIDA 	= СерийныйНомерAIDA;
	НоваяСтрока.ПроизводительAIDA 	= ПроизводительAIDA;	
	НоваяСтрока.ИсключенияAIDA		= ИсключенияAIDA;
	НоваяСтрока.ОпределениеБезРодительскойСекцииAIDA			= ОпределениеБезРодительскойСекцииAIDA;
	НоваяСтрока.ПриПоискеВключатьЗначениеПеременнойСекцииAIDA	= ПриПоискеВключатьЗначениеПеременнойСекцииAIDA;
	
КонецПроцедуры

Процедура ДобавитьВТЗЭлементы(ТЗ,
	Характеристика,
	Наименование,
	Родитель,
	СвойствоWMI,
	ДелитьНаЧислоWMI = 0,
	СвойствоAIDA,
	ДелитьНаЧислоAIDA = 0,
	ОпределениеБезРодительскойСекцииAIDA = Ложь,
	ПриПоискеВключатьЗначениеПеременнойСекцииAIDA = Ложь,
	ИсключенияAIDA = "",
	ИспользоватьВАвтоНаименовании = Ложь,
	ПредставлениеВАвтоНаименовании = "",
	ИспользоватьПредставлениеВАвтоНаименовании = Ложь,
	ИсключенияWMI = "")
	
	НоваяСтрока 					= ТЗ.Добавить();
	НоваяСтрока.Характеристика 		= Характеристика;
	НоваяСтрока.Наименование 		= Наименование;
	НоваяСтрока.СвойствоWMI 		= СвойствоWMI;
	НоваяСтрока.Родитель 			= Родитель;
	НоваяСтрока.ДелитьНаЧислоWMI 	= ДелитьНаЧислоWMI;
	НоваяСтрока.СвойствоAIDA 		= СвойствоAIDA;
	НоваяСтрока.ДелитьНаЧислоAIDA 	= ДелитьНаЧислоAIDA;
	НоваяСтрока.ИсключенияAIDA		= ИсключенияAIDA;	
	НоваяСтрока.ИсключенияWMI		= ИсключенияWMI;	
	
	НоваяСтрока.ОпределениеБезРодительскойСекцииAIDA 			= ОпределениеБезРодительскойСекцииAIDA;
	НоваяСтрока.ПриПоискеВключатьЗначениеПеременнойСекцииAIDA 	= ПриПоискеВключатьЗначениеПеременнойСекцииAIDA;
	НоваяСтрока.ПредставлениеВАвтоНаименовании 					= ПредставлениеВАвтоНаименовании;
	НоваяСтрока.ИспользоватьПредставлениеВАвтоНаименовании		= ИспользоватьПредставлениеВАвтоНаименовании;
	НоваяСтрока.ИспользоватьВАвтоНаименовании					= ИспользоватьВАвтоНаименовании;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
